{
  "profile": [
    "I am a dedicated frontend developer with over three years of hands-on experience in building dynamic and responsive web applications. My primary expertise lies in frontend development using React and its advanced frameworks such as Next.js. I have a strong passion for creating user-friendly interfaces and seamless user experiences, leveraging my deep understanding of JavaScript, HTML, and CSS."
  ],
  "details": [
    {
      "type": "text",
      "name": "Country",
      "value": "Belarus"
    },
    {
      "type": "text",
      "name": "City",
      "value": "Gomel"
    },
    {
      "type": "tel",
      "name": "Phone",
      "value": "+375 33 308 69 65"
    },
    {
      "type": "email",
      "name": "Email",
      "value": "chekhstanislavdev@gmail.com"
    },
    {
      "type": "telegram",
      "name": "Telegram",
      "value": "chekhstas"
    },
    {
      "type": "github",
      "name": "Github",
      "value": "Lazeta"
    }
  ],
  "skills": [
    {
      "name": "HTML/CSS",
      "value": "Strong understanding of HTML markup and CSS styling, including responsive design (using media queries, flexbox, or CSS grid layouts), CSS preprocessors (e.g., Sass), and CSS frameworks (e.g., Bootstrap, Tailwind CSS)"
    },
    {
      "name": "JavaScript/TypeScript",
      "value": "Proficient in JavaScript/TypeScript programming, with a strong understanding of its core concepts, features, and modern ES6+ syntax"
    },
    {
      "name": "React/Next",
      "value": "Proficient in React library, including its component-based architecture, virtual DOM, and state management concepts. Experienced in building dynamic user interfaces and scalable web applications with its popular frameworks such as Next.js, leveraging their server-side rendering (SSR) capabilities, routing, and API integration features to create high-performance and SEO-friendly applications"
    },
    {
      "name": "Redux/RTK Query",
      "value": "Proficient in Redux, including its state management concepts, actions, reducers, and middleware, and experience in using RTK Query for efficient data fetching and caching, ensuring scalability and performance in complex applications"
    },
    {
      "name": "REST API/GraphQL",
      "value": "Understanding of RESTful principles and experience in consuming and integrating data from APIs, including handling requests, authentication, data manipulation, and implementing GraphQL queries and mutations"
    }
  ],
  "education": [
    {
      "name": "Gomel State Professional Engineering Lyceum (2010-2013). “Electrician of high-voltage lines and Mechanic repairman for servicing machines and lines",
      "value": "https://adukar.com/by/company/364"
    },
    {
      "name": "RS School Course 2023 Q2",
      "value": "https://app.rs.school/certificate/gy246u65"
    }
  ],
  "experience": [
    {
      "name": "Frontend Developer",
      "project": "Banking Application",
      "description": "Development of the client-side for a multifunctional banking application designed for personal finance management. Key features included user profile management, display of bank cards, account details, transaction filtering, and API integration for real-time data processing",
      "path": "",
      "startAt": "2023-06-01T00:00:00.000Z",
      "endAt": "2025-12-01T00:00:00.000Z",
      "role": [
        "Designed and implemented a modular frontend architecture using React , ensuring scalability and maintainability",
        "Integrated RESTful APIs for real-time data fetching and state management using Redux and RTK Query , optimizing API calls with pagination and caching",
        "Improved rendering performance for large datasets (e.g., transaction history) by implementing virtualization and memoization , reducing render time by 30% ",
        "Ensured compliance with accessibility standards (WCAG and cross-browser compatibility across modern browsers",
        "Wrote unit tests using Jest and React Testing Library , achieving 85%+ coverage for critical components"
      ],
      "stack": ["React", "TypeScript", "Redux toolkit", "RTK Query", "Router", "Prisma", "HTML5", "CSS3", "Webpack", "Git", "Figma", "REST API", "Postman", "Jest", "Mocha"]
    }
  ]
}
